app/controllers/movies_controller.rb

  def show
    @id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(@id) # look up movie by unique ID
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

  def similar_dir
    @movie = Movie.find(params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]